# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. üôÇ

In [448]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you‚Äôll‚Äïof course‚Äïovercome them with what you learned in class! üòâ

## Food Choices Data Set

### Load the Data

In [449]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = 'data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)

### Explore the Data

How much data did you just load? <br>
<b> Answer: (125, 61) -> 125 Rows and 61 Columns/Features </b>

In [450]:
# Count by hand. (lol kidding)
df_food.shape

(125, 61)

What are the columns and their types in this data set?

In [451]:
# Show the column names and their types.
names_and_types = {}
# Manually print so it does not get truncated
for column, type in zip(df_food, df_food.dtypes):
    names_and_types[column] = type

for key_value in names_and_types:
    print(f"Column: {key_value}, Type: {names_and_types[key_value]}")

Column: GPA, Type: object
Column: Gender, Type: int64
Column: breakfast, Type: int64
Column: calories_chicken, Type: int64
Column: calories_day, Type: float64
Column: calories_scone, Type: float64
Column: coffee, Type: int64
Column: comfort_food, Type: object
Column: comfort_food_reasons, Type: object
Column: comfort_food_reasons_coded, Type: float64
Column: cook, Type: float64
Column: comfort_food_reasons_coded.1, Type: int64
Column: cuisine, Type: float64
Column: diet_current, Type: object
Column: diet_current_coded, Type: int64
Column: drink, Type: float64
Column: eating_changes, Type: object
Column: eating_changes_coded, Type: int64
Column: eating_changes_coded1, Type: int64
Column: eating_out, Type: int64
Column: employment, Type: float64
Column: ethnic_food, Type: int64
Column: exercise, Type: float64
Column: father_education, Type: float64
Column: father_profession, Type: object
Column: fav_cuisine, Type: object
Column: fav_cuisine_coded, Type: int64
Column: fav_food, Type: float64
Column: food_childhood, Type: object
Column: fries, Type: int64
Column: fruit_day, Type: int64
Column: grade_level, Type: int64
Column: greek_food, Type: int64
Column: healthy_feeling, Type: int64
Column: healthy_meal, Type: object
Column: ideal_diet, Type: object
Column: ideal_diet_coded, Type: int64
Column: income, Type: float64
Column: indian_food, Type: int64
Column: italian_food, Type: int64
Column: life_rewarding, Type: float64
Column: marital_status, Type: float64
Column: meals_dinner_friend, Type: object
Column: mother_education, Type: float64
Column: mother_profession, Type: object
Column: nutritional_check, Type: int64
Column: on_off_campus, Type: float64
Column: parents_cook, Type: int64
Column: pay_meal_out, Type: int64
Column: persian_food, Type: float64
Column: self_perception_weight, Type: float64
Column: soup, Type: float64
Column: sports, Type: float64
Column: thai_food, Type: int64
Column: tortilla_calories, Type: float64
Column: turkey_calories, Type: int64
Column: type_sports, Type: object
Column: veggies_day, Type: int64
Column: vitamins, Type: int64
Column: waffle_calories, Type: int64
Column: weight, Type: object

### Clean the Data

Perhaps we‚Äôd like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. ‚Ä¶and maybe gender.

Can you remove the other columns?

In [452]:
# Remove ‚Äòem.
columns_to_keep = ["calories_day", "weight", "Gender"]

df_food_filtered = df_food.loc[:, columns_to_keep]
df_food_filtered

     calories_day                    weight  Gender
0             NaN                       187       2
1             3.0                       155       1
2             4.0  I'm not answering this.        1
3             3.0             Not sure, 240       1
4             2.0                       190       1
..            ...                       ...     ...
120           4.0                       156       1
121           2.0                       180       1
122           NaN                       120       1
123           4.0                       135       2
124           NaN                       135       1

[125 rows x 3 columns]

What about `NaN`s? How many are there?

In [453]:
# Count ‚Äòem.
df_food_filtered.isna().sum()

calories_day    19
weight           2
Gender           0
dtype: int64

We gotta remove those `NaN`s‚Äïthe entire row.

In [454]:
# Drop ‚Äòem.
df_food_filtered = df_food_filtered.dropna()

In [455]:
df_food_filtered
df_food_filtered.isna().sum()

calories_day    0
weight          0
Gender          0
dtype: int64

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. ü§î

In [456]:
# Fix that.
df_food_filtered.at[3, 'weight'] = float(240)
# Drop Column where weight has the value "I don't want to answer that.' "
df_food_filtered = df_food_filtered.drop(2, axis=0)
# Remove entries with 'lbs' in the unit
df_food_filtered['weight'] = df_food_filtered['weight'].str.replace(' lbs', '').astype(float)

# Convert dtypes
df_food_filtered.astype({
    'calories_day' : float,
    'Gender' : int,
    'weight' : float
})

# Fix the row with 'weight' column entry = "'Not sure, 240" to just 240
df_food_filtered.at[3, 'weight'] = float(240)

In [457]:
df_food_filtered.dtypes

calories_day    float64
weight          float64
Gender            int64
dtype: object

In [458]:
df_food_filtered.head(10)

    calories_day  weight  Gender
1            3.0   155.0       1
3            3.0   240.0       1
4            2.0   190.0       1
5            3.0   190.0       1
6            3.0   180.0       2
7            3.0   137.0       1
9            3.0   125.0       1
10           3.0   116.0       1
11           4.0   110.0       1
12           3.0   264.0       2

Now this data seems reasonably clean for our purposes! üòÅ

Let‚Äôs save it somewhere to be shipped off to another teammate. üíæ

In [459]:
# Savey save!
df_food_filtered.to_csv('data/cleaned_food_coded.csv', index=False)

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [460]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('data/manager_salary_survey_2021.tsv', sep='\t')
df_salary.head(5)

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

Was that hard? üôÉ <br>
<b> Answer: No, but I definitely learned what a TSV file was and how powerful pandas is as all I needed to do was add the 'sep' argument </b>

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case <br>

<b> new file name: manager_salary_survey_2021.tsv </b>

### Explore

You know the drill.

How much data did you just load? <br>
<b> 28062 Rows and 18 Columns/Features </b>

In [461]:
# Count by hand. I‚Äôm dead serious.
df_salary.shape

(28062, 18)

What are the columns and their types?

In [462]:
# Show the column names and their types.
print(df_salary.dtypes)

Timestamp                                                                                                                                                                                                                                object
How old are you?                                                                                                                                                                                                                         object
What industry do you work in?                                                                                                                                                                                                            object
Job title                                                                                                                                                                                                                                object
If your job title needs additional context, please clarify here:                                                                                                                                                                         object
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)     object
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          float64
Please indicate the currency                                                                                                                                                                                                             object
If "Other," please indicate the currency here:                                                                                                                                                                                           object
If your income needs additional context, please provide it here:                                                                                                                                                                         object
What country do you work in?                                                                                                                                                                                                             object
If you're in the U.S., what state do you work in?                                                                                                                                                                                        object
What city do you work in?                                                                                                                                                                                                                object
How many years of professional work experience do you have overall?                                                                                                                                                                      object
How many years of professional work experience do you have in your field?                                                                                                                                                                object
What is your highest level of education completed?                                                                                                                                                                                       object
What is your gender?                                                                                                                                                                                                                     object
What is your race? (Choose all that apply.)                                                                                                                                                                                              object
dtype: object

Oh‚Ä¶ Ugh! Give these columns easier names to work with first. üôÑ

In [463]:
# Rename ‚Äòem.

# Colnames array
colnames = [
    'timestamp', 'age', 'industry', 'title', 'title_context', 'salary', 
    'additional_compensation', 'currency', 'other_currency', 'salary_context', 
    'country', 'state', 'city', 'total_yoe', 'field_yoe', 'highest_education_completed',
    'gender', 'race'
]

# Change colnames to use colnames array
df_salary.columns = colnames

In [464]:
print(df_salary.dtypes)

timestamp                       object
age                             object
industry                        object
title                           object
title_context                   object
salary                          object
additional_compensation        float64
currency                        object
other_currency                  object
salary_context                  object
country                         object
state                           object
city                            object
total_yoe                       object
field_yoe                       object
highest_education_completed     object
gender                          object
race                            object
dtype: object

It‚Äôs a lot, and that should not have been easy. üòè

You‚Äôre going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [465]:
# List the unique industries and a count of their instances.
df_salary['industry'].unique()

array(['Education (Higher Education)', 'Computing or Tech',
       'Accounting, Banking & Finance', ...,
       "I'm currently a student and don't have a job", 'Student ',
       'Wine & Spirits'], dtype=object)

That value among the top 5 is what you‚Äôre looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [466]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_tech = df_salary[df_salary['industry'] == 'Computing or Tech']

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [467]:
# Sanity Check 
df_salary_tech

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28050,7/1/2024 13:38:46,25-34,Computing or Tech,Research & Systems Technician Data Analytics,NaN,22000,NaN,EUR,NaN,NaN,Spain,NaN,Barcelona,2 - 4 years,2 - 4 years,College degree,Man,"Hispanic, Latino, or Spanish origin"
28051,7/1/2024 20:05:58,25-34,Computing or Tech,Junior data analyst,NaN,35000,15000.0,USD,NaN,NaN,Usa,Alabama,Alabama,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American
28052,7/3/2024 14:02:01,25-34,Computing or Tech,Senior Global Public Relations Manager,NaN,144000,15000.0,USD,NaN,NaN,Usa,Massachusetts,Boise-but remote. Company located in Boston,8 - 10 years,8 - 10 years,Master's degree,Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,USA,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American

We are very interested in salary figures. But how many dollars üíµ is a euro üí∂ or a pound üí∑? That sounds like a problem for another day. ü´†

For now, let‚Äôs just look at U.S. dollars (`'USD'`).

In [468]:
# Filtery filter for just the jobs that pay in USD!
df_salary_tech = df_salary_tech[df_salary_tech['currency'] == 'USD']
df_salary_tech

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,USA,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
28044,6/3/2024 16:15:43,18-24,Computing or Tech,Research Data Analyst Associate,NaN,60000,0.0,USD,NaN,NaN,United States,Illinois,Evanston,2 - 4 years,1 year or less,College degree,Woman,White
28051,7/1/2024 20:05:58,25-34,Computing or Tech,Junior data analyst,NaN,35000,15000.0,USD,NaN,NaN,Usa,Alabama,Alabama,2 - 4 years,2 - 4 years,College degree,Woman,Black or African American
28052,7/3/2024 14:02:01,25-34,Computing or Tech,Senior Global Public Relations Manager,NaN,144000,15000.0,USD,NaN,NaN,Usa,Massachusetts,Boise-but remote. Company located in Boston,8 - 10 years,8 - 10 years,Master's degree,Woman,White
28058,7/23/2024 17:51:03,25-34,Computing or Tech,Systems Architect,NaN,109000,NaN,USD,NaN,NaN,USA,Georgia,Atlanta,5-7 years,5-7 years,College degree,Man,White
28060,7/26/2024 11:20:45,18-24,Computing or Tech,IT,NaN,1700,10.0,USD,NaN,NaN,Burma,NaN,Yangon,2 - 4 years,1 year or less,Some college,Man,Asian or Asian American

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [469]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
df_salary_tech['country'].unique()

array(['US', 'United States', 'USA', 'United States of America',
       'United States ', 'U.S. ', 'US ', 'usa', 'United states',
       'United State of America', 'USA ', 'U.S.', 'us', 'Usa',
       'united states', 'Uniyed states', 'U.S.A.', 'America',
       'Puerto Rico ', 'U.s.', ' US', 'Unite States', 'Us',
       'United State', 'Australia', 'Cuba', 'Danmark', 'Canada', 'Italy',
       'International ', 'UnitedStates', 'Israel', 'India',
       'United Stated', 'U.S', 'Usa ', 'Remote (philippines)',
       'Singapore', 'United States Of America', 'Spain',
       'United States of America ', 'Uruguay', 'Brazil', 'Mexico',
       'United Kingdom', 'Canada ', 'United Stateds', 'ISA', 'singapore',
       'Pakistan', 'united States', 'New Zealand', 'Poland', 'France',
       'Netherlands', 'China', 'San Francisco', 'Romania',
       'United STates', 'Japan', 'U.S.A', 'United Stares',
       'United States of america', 'Australian ', 'Denmark', 'Jamaica',
       'Unites States', 'Thailand', 'U.S.A ', 'Colombia', 'denmark',
       'Ghana', 'Nigeria ', 'ss', 'Nigeria', 'Burma'], dtype=object)

### Clean the Data

Well, we can‚Äôt get our answers with what we currently have, so you‚Äôll have to make some changes.

Let‚Äôs not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value‚Äïsay, `'US'`, which is nice and short.

In [470]:
# Replace them all with 'US'.
us_entries = ['US', 'United States', 'USA', 'United States of America', 'United States ', 'U.S. ', 
 'US ', 'usa', 'United states', 'United State of America', 'USA ', 'U.S.', 'us', 'Usa', 
 'united states', 'Uniyed states', 'U.S.A.', 'America', 'U.s.', ' US', 'Unite States', 
 'Us', 'United State', 'UnitedStates', 'United Stated', 'U.S', 'Usa ', 
 'United States Of America', 'United States of America ', 'ISA', 'united States', 
 'United STates', 'U.S.A', 'United Stares', 'United States of america', 'ss', 'United Stateds', 'Unites States', 'San Francisco', 
 'U.S.A ']

df_salary_tech['country'] = df_salary_tech['country'].replace(us_entries, 'US')

C:\Users\usflo\AppData\Local\Temp\ipykernel_2108\4112592190.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_tech['country'] = df_salary_tech['country'].replace(us_entries, 'US')

Have a look at the count of each unique country again now.

In [471]:
# Count again.
df_salary_tech['country'].unique()

array(['US', 'Puerto Rico ', 'Australia', 'Cuba', 'Danmark', 'Canada',
       'Italy', 'International ', 'Israel', 'India',
       'Remote (philippines)', 'Singapore', 'Spain', 'Uruguay', 'Brazil',
       'Mexico', 'United Kingdom', 'Canada ', 'singapore', 'Pakistan',
       'New Zealand', 'Poland', 'France', 'Netherlands', 'China',
       'Romania', 'Japan', 'Australian ', 'Denmark', 'Jamaica',
       'Thailand', 'Colombia', 'denmark', 'Ghana', 'Nigeria ', 'Nigeria',
       'Burma'], dtype=object)

Did you notice anything interesting?

In [472]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.
print("I took all varieties of USA into account even the not so obvious ones like: 'ss', I had to check the 'state' column to verify if it was in the USA")

I took all varieties of USA into account even the not so obvious ones like: 'ss', I had to check the 'state' column to verify if it was in the USA

In [473]:
# BONUS CREDIT: if you‚Äôve resolved it, let‚Äôs see how well you did by counting the number of instances of each unique value.
unique = ''' 
['US', 'Puerto Rico ', 'Australia', 'Cuba', 'Danmark', 'Canada',
       'Italy', 'International ', 'Israel', 'India',
       'Remote (philippines)', 'Singapore', 'Spain', 'Uruguay', 'Brazil',
       'Mexico', 'United Kingdom', 'Canada ', 'singapore', 'Pakistan',
       'New Zealand', 'Poland', 'France', 'Netherlands', 'China',
       'Romania', 'Japan', 'Australian ', 'Denmark', 'Jamaica',
       'Thailand', 'Colombia', 'denmark', 'Ghana', 'Nigeria ', 'Nigeria',
       'Burma']
'''
print(f"I turned all unique values into 'US' \n\n But here are other entires: \n {unique}")

I turned all unique values into 'US'

 But here are other entires:

['US', 'Puerto Rico ', 'Australia', 'Cuba', 'Danmark', 'Canada',
       'Italy', 'International ', 'Israel', 'India',
       'Remote (philippines)', 'Singapore', 'Spain', 'Uruguay', 'Brazil',
       'Mexico', 'United Kingdom', 'Canada ', 'singapore', 'Pakistan',
       'New Zealand', 'Poland', 'France', 'Netherlands', 'China',
       'Romania', 'Japan', 'Australian ', 'Denmark', 'Jamaica',
       'Thailand', 'Colombia', 'denmark', 'Ghana', 'Nigeria ', 'Nigeria',
       'Burma']

It‚Äôs looking good so far. Let‚Äôs find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [474]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
min_val = df_salary_tech.groupby('state')['salary'].min()
mean_val = df_salary_tech.groupby('state')['salary'].mean()
max_val = df_salary.groupby('state')['salary'].max()

print(min_val)

TypeError: agg function failed [how->mean,dtype->object]

Well, pooh! We forgot that `salary` isn‚Äôt numeric. Something wrong must be fixed.

In [ ]:
# Fix it.
df_salary_tech['salary'] = df_salary_tech['salary'].str.replace(',', '')
df_salary_tech['salary'] = df_salary_tech['salary'].astype(int)

Let‚Äôs try that again.

That did the trick! Now let‚Äôs narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [ ]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
# Find the minimum, mean, and maximum salary in USD by U.S. state.
min_val = df_salary_tech.groupby('state')['salary'].min()
mean_val = df_salary_tech.groupby('state')['salary'].mean()
max_val = df_salary.groupby('state')['salary'].max()

In [ ]:
print(min_val)

In [ ]:
print(mean_val)

In [ ]:
print(max_val)

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you‚Äôve now reached. What do you notice about Delaware and West Virginia?

Let‚Äôs back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [478]:
# Fix colnames
df_salary.columns = colnames
# Standardize US Entries
df_salary['country'] = df_salary['country'].replace(us_entries, 'US')
# Convert salary to int64, int is too small 
df_salary['salary'] = df_salary['salary'].str.replace(',', '')
df_salary['salary'] = df_salary['salary'].astype('Int64')

In [479]:
df_salary_min_val = df_salary.groupby('state')['salary'].min()
df_salary_mean_val = df_salary.groupby('state')['salary'].mean()
df_salary_max_val = df_salary.groupby('state')['salary'].max()

In [480]:
print(df_salary_min_val)

state
Alabama                               0
Alabama, Alaska, Arizona             15
Alabama, California               29120
Alabama, District of Columbia    156000
Alabama, Kansas                   64197
                                  ...
Virginia                             57
Washington                           72
West Virginia                         0
Wisconsin                             1
Wyoming                           29000
Name: salary, Length: 134, dtype: Int64

In [481]:
print(df_salary_mean_val)

state
Alabama                            98178.47541
Alabama, Alaska, Arizona                  15.0
Alabama, California                    29120.0
Alabama, District of Columbia         156000.0
Alabama, Kansas                        64197.0
                                     ...
Virginia                          94679.388041
Washington                       107803.852196
West Virginia                     59162.928571
Wisconsin                         76351.454158
Wyoming                           58089.291667
Name: salary, Length: 134, dtype: Float64

In [482]:
print(df_salary_max_val)

state
Alabama                          3600000
Alabama, Alaska, Arizona              15
Alabama, California                29120
Alabama, District of Columbia     156000
Alabama, Kansas                    64197
                                  ...
Virginia                         1300000
Washington                       1260000
West Virginia                     125000
Wisconsin                         920000
Wyoming                           140000
Name: salary, Length: 134, dtype: Int64

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

In [486]:
df_salary_styled = df_salary.style.format({'salary': '${:,.2f}'})
# df_salary_styled
print("Styled object prints the entire df. It also loses the .head() method cause it became a different object")

Styled object prints the entire df. It also loses the .head() method cause it became a different object

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

In [492]:
# List of multi-state entries
multi_state_entries = [
    'Kentucky, Ohio', 'District of Columbia, Virginia', 'District of Columbia, Maryland', 'Arizona, Washington',
    'Georgia, New York', 'California, Colorado', 'California, Oregon', 'District of Columbia, Maryland, Pennsylvania, Virginia',
    'Arizona, California', 'North Carolina, Utah', 'Ohio, Wyoming', 'Georgia, Tennessee', 'Massachusetts, Oregon', 'Alabama, Montana',
    'Alabama, District of Columbia', 'California, Pennsylvania', 'New Jersey, Pennsylvania', 'Georgia, Washington', 'Alaska, Maryland',
    'Michigan, South Carolina', 'Massachusetts, Rhode Island', 'Georgia, Minnesota', 'Colorado, Nevada', 'Maine, Massachusetts, New Hampshire, North Carolina',
    'Alabama, Minnesota, Nevada', 'New Jersey, New York', 'Arizona, Utah', 'Alabama, Kansas', 'California, Oklahoma', 'Illinois, Wisconsin', 'Illinois, Kentucky',
    'Arizona, California, Nevada, Texas', 'Alaska, Idaho, Oregon, Utah, Washington', 'Massachusetts, Pennsylvania', 'Nevada, Oregon', 'New Jersey, Virginia',
    'Montana, Wyoming', 'Colorado, Massachusetts', 'District of Columbia, Maryland, Virginia', 'Massachusetts, Vermont', 'Massachusetts, New Hampshire',
    'Arkansas, Iowa, Massachusetts, Ohio, Wyoming', 'New York, Texas', 'California, Montana', 'Iowa, Utah, Vermont', 'Texas, Virginia', 'Utah, Vermont',
    'Arkansas, Illinois', 'Georgia, Massachusetts', 'Maryland, Virginia', 'Florida, Georgia, South Carolina',
    'Arkansas, Idaho, Kansas, Louisiana, Michigan, Mississippi, Nevada, New York, South Carolina, Tennessee, Washington',
    'California, Texas', 'Indiana, Ohio', 'Ohio, Washington', 'Kansas, Missouri', 'Colorado, Illinois',
    'Arizona, Hawaii, Illinois, Michigan, Utah, Wyoming', 'California, New Jersey', 'Louisiana, Washington',
    'Maryland, New York', 'District of Columbia, Washington', 'Delaware, Pennsylvania', 'Illinois, North Carolina',
    'Indiana, Massachusetts', 'Florida, New Hampshire, Wisconsin', 'Pennsylvania, Rhode Island', 'New York, Oregon, Vermont',
    'Iowa, Nebraska', 'California, New York', 'Arizona, New York', 'California, District of Columbia, Illinois, Iowa, Maryland, Minnesota',
    'Oregon, Washington', 'New York, Virginia', 'Mississippi, Missouri', 'California, Maryland', 'California, Illinois, Massachusetts, North Carolina, South Carolina, Virginia',
    'Alabama, California', 'Michigan, Texas, Washington', 'Alabama, Oregon', 'Alabama, Alaska, Arizona', 'Alabama, South Carolina',
    'Colorado, Delaware, New Jersey, West Virginia, Wyoming'
]

# Function to replace multi-state entries with the last state
def replace_multi_state_entries(entry):
    if isinstance(entry, str):                          # Ensure the entry is a string (not NaN)
        if ',' in entry:                                # Check if the entry contains multiple states
            return entry.split(',')[-1].strip()         # Get the last state and strip any extra spaces
    return entry                                        # Return the entry unchanged if it's a single state or NaN

# Apply the function to convert multi-state entries to the last state
df_salary['state'].astype(str)
df_salary['state'] = df_salary['state'].apply(replace_multi_state_entries)

# Display the updated DataFrame
df_salary['state'].unique()

array(['Massachusetts', nan, 'Tennessee', 'Wisconsin', 'South Carolina',
       'New Hampshire', 'Arizona', 'Missouri', 'Florida', 'Pennsylvania',
       'Michigan', 'Minnesota', 'Illinois', 'California', 'Georgia',
       'Ohio', 'District of Columbia', 'Maryland', 'Texas', 'Virginia',
       'North Carolina', 'New York', 'New Jersey', 'Rhode Island',
       'Colorado', 'Oregon', 'Washington', 'Indiana', 'Iowa', 'Nebraska',
       'Oklahoma', 'Maine', 'Connecticut', 'South Dakota',
       'West Virginia', 'Idaho', 'Louisiana', 'Montana', 'Kentucky',
       'North Dakota', 'Kansas', 'Vermont', 'Arkansas', 'Alabama',
       'Nevada', 'Delaware', 'New Mexico', 'Hawaii', 'Utah',
       'Mississippi', 'Alaska', 'Wyoming'], dtype=object)

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum‚Äïsay 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you‚Äïlike say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* üòú)

In [495]:
quantiles = [0, 0.05, 0.25, 0.50, 0.75, 0.95, 1.0]                                                  # Define quantiles
quantile_stats = df_salary.groupby('state')['salary'].quantile(quantiles).unstack()                 # Obtain quantile values

# Count number of rows per group
count_by_state = df_salary.groupby('state')['salary'].count()

# Merge the count information with the quantile statistics
summary = quantile_stats.merge(count_by_state.rename('count'), left_index=True, right_index=True)

# Sort by the 50th percentile 
summary_sorted = summary.sort_values(by=0.50)

In [496]:
summary_sorted

,0.0,0.05,0.25,0.5,0.75,0.95,1.0,count
state,,,,,,,,
West Virginia,0.0,27050.0,41250.0,49544.0,74100.0,117465.2,125000.0,42
Montana,19200.0,33631.0,37125.0,49700.0,84250.0,129500.0,185000.0,66
Wyoming,5.0,29963.2,42500.0,50128.0,77016.0,123200.0,140000.0,29
Mississippi,25000.0,31100.0,37031.5,54000.0,82000.0,112000.0,130000.0,51
Oklahoma,18000.0,27648.4,43236.0,54040.0,80000.0,141550.0,180000.0,114
South Carolina,0.0,29178.5,43670.0,56750.0,78937.5,134950.0,5000000.0,150
Maine,22000.0,34564.25,43125.0,57750.0,83000.0,114750.0,173000.0,126
North Dakota,0.0,27584.0,45000.0,59000.0,75000.0,110500.0,150000.0,35
Kentucky,0.0,29000.0,43441.0,59317.5,78000.0,130000.0,208000.0,192
Alabama,0.0,20140.0,45000.0,59500.0,84750.0,164450.0,3600000.0,122
Idaho,38.0,30960.0,46000.0,60000.0,78000.0,130000.0,312000.0,97
Arkansas,4.0,30000.0,45880.0,60000.0,87400.0,144500.0,488000.0,71
South Dakota,29000.0,31560.0,45750.0,60000.0,66805.0,126800.0,150000.0,25
Vermont,24960.0,32550.0,50750.0,61000.0,84750.0,127250.0,200000.0,72
Kansas,52.0,33650.0,45125.0,61250.0,81000.0,125000.0,734400.0,154
Iowa,13000.0,30000.0,47840.0,62500.0,87000.0,122975.0,200000.0,179
Louisiana,17000.0,30272.0,47000.0,62500.0,85000.0,150000.0,253300.0,129
Hawaii,12000.0,31107.0,53250.0,62850.0,75000.0,123100.0,500000.0,30
Tennessee,20800.0,33028.0,47750.0,63000.0,85000.0,155800.0,657900.0,283
Nebraska,18000.0,33144.5,46650.0,64000.0,86500.0,137500.0,224000.0,111
Missouri,70.0,30560.0,47840.0,65000.0,94000.0,145000.0,335000.0,345
Indiana,105.0,33050.0,48825.0,65000.0,84752.5,134300.0,925000.0,328
New Hampshire,55.0,30994.4,46600.0,65000.0,89250.0,142468.25,208000.0,120
Wisconsin,1.0,34000.0,50000.0,66560.0,90000.0,146000.0,920000.0,471
Arizona,15.0,34000.0,50000.0,66700.0,100000.0,154900.0,380000.0,303
Florida,150.0,31200.0,47762.0,67000.0,97875.0,162950.0,2600000.0,522
Michigan,55.0,32000.0,52000.0,67500.0,90000.0,147638.4,500000.0,545
Ohio,36.0,33000.0,50000.0,67550.0,89753.75,150000.0,954000.0,658
New Mexico,78.0,33892.0,52000.0,69000.0,107000.0,166800.0,300000.0,98
Pennsylvania,0.0,33067.5,52000.0,70250.0,100000.0,165000.0,1100000.0,950
Nevada,55.0,34449.4,52500.0,71000.0,95700.0,171500.0,425000.0,95
Rhode Island,18000.0,36210.0,52546.0,71500.0,95625.0,132150.0,200000.0,78
Alaska,27040.0,40000.0,55500.0,72400.0,91500.0,154750.0,10000000.0,66
Utah,18720.0,34054.0,54087.5,72903.5,100000.0,175550.0,576000.0,210
North Carolina,4000.0,34535.9,51000.0,73000.0,98000.0,150000.0,560000.0,603
Georgia,0.0,32000.0,53000.0,75000.0,105000.0,173400.0,860000.0,537
Minnesota,40.0,39616.0,55000.0,75000.0,100000.0,150000.0,321250.0,725
New Jersey,14850.0,35000.0,57750.0,75000.0,104250.0,180050.0,5000044.0,400
Colorado,65.0,38312.0,58000.0,76000.0,110750.0,165675.0,630000.0,634
Texas,0.0,35118.0,55000.0,76000.0,110000.0,175000.0,1200000.0,1271
Illinois,0.0,37440.0,56000.0,76000.0,110000.0,172240.0,1100000.0,1215
Oregon,0.0,36760.0,58000.0,78000.0,110000.0,185000.0,320000.0,633
Delaware,35000.0,40480.0,57546.5,80145.0,105500.0,163297.0,220000.0,47
Virginia,57.0,37400.0,58750.0,81000.0,114059.0,180000.0,1300000.0,801
Connecticut,0.0,33872.5,62000.0,82000.0,100000.0,161500.0,1900000.0,238
Maryland,0.0,40450.0,60000.0,82000.0,110000.0,165000.0,353200.0,570
Massachusetts,155.0,42000.0,64000.0,86000.0,120000.0,181600.0,1650000.0,1525
New York,80.0,40576.0,64581.25,90000.0,128000.0,210000.0,3000000.0,2182
District of Columbia,40.0,48075.0,66800.0,90000.0,125000.0,188550.0,1334782.0,984
Washington,72.0,39860.0,65000.0,91000.0,135000.0,201700.0,1260000.0,1194
California,0.0,42000.0,72000.0,100260.0,147000.0,220000.0,875000.0,2613